RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/include_pvt/cyhal_hw_resources.h
    CYHAL_CLOCK_BLOCK_LF,                                           /*!< Low Frequency Clock */
    CYHAL_CLOCK_BLOCK_HF,                                           /*!< High Frequency Clock */
    CYHAL_CLOCK_BLOCK_PUMP,                                         /*!< Analog Pump Clock */
    CYHAL_CLOCK_BLOCK_BAK,                                          /*!< Backup Power Domain Clock */
    CYHAL_CLOCK_BLOCK_ALT_SYS_TICK,                                 /*!< Alternative SysTick Clock */

    CYHAL_CLOCK_BLOCK_PERI,                                         /*!< Peripheral Clock Group */
    CYHAL_CLOCK_BLOCK_FAST,                                         /*!< Fast Clock for CM7 */
    CYHAL_CLOCK_BLOCK_SLOW,                                         /*!< Slow Clock for CM0+ */
    CYHAL_CLOCK_BLOCK_MEM,                                          /*!< CLK MEM */
    CYHAL_CLOCK_BLOCK_TIMER,                                        /*!< CLK Timer */

#elif defined(COMPONENT_CAT1D)

    CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT = CY_SYSCLK_DIV_8_BIT,        /*!< Equivalent to CYHAL_CLOCK_BLOCK_PERIPHERAL0_8_BIT */
    CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT = CY_SYSCLK_DIV_16_BIT,      /*!< Equivalent to CYHAL_CLOCK_BLOCK_PERIPHERAL0_16_BIT */
    CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT = CY_SYSCLK_DIV_16_5_BIT,  /*!< Equivalent to CYHAL_CLOCK_BLOCK_PERIPHERAL0_16_5_BIT */
    CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT = CY_SYSCLK_DIV_24_5_BIT,  /*!< Equivalent to CYHAL_CLOCK_BLOCK_PERIPHERAL0_24_5_BIT */

    // The first four items are here for backwards compatability with old clock APIs
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 1)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(0),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 2)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(1),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 3)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(2),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 4)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(3),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 5)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(4),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 6)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(5),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 7)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(6),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 8)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(7),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 9)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(8),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 10)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(9),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 11)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(10),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 12)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(11),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 13)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(12),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 14)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(13),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 15)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(14),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR >= 16)
    _CYHAL_CLOCK_BLOCK_PERI_GROUP(15),
    #endif

    CYHAL_CLOCK_BLOCK_IMO,                                          /*!< Internal Main Oscillator Input Clock */
    CYHAL_CLOCK_BLOCK_ECO,                                          /*!< External Crystal Oscillator Input Clock */
    CYHAL_CLOCK_BLOCK_EXT,                                          /*!< External Input Clock */
    CYHAL_CLOCK_BLOCK_ILO,                                          /*!< Internal Low Speed Oscillator Input Clock */
    CYHAL_CLOCK_BLOCK_ILO1,
    CYHAL_CLOCK_BLOCK_WCO,                                          /*!< Watch Crystal Oscillator Input Clock */

    CYHAL_CLOCK_BLOCK_PATHMUX,                                      /*!< Path selection mux for input to FLL/PLLs */

    CYHAL_CLOCK_BLOCK_FLL,                                          /*!< Frequency-Locked Loop Clock */
    CYHAL_CLOCK_BLOCK_PLL200,                                       /*!< 200MHz Phase-Locked Loop Clock */
    CYHAL_CLOCK_BLOCK_PLL400,                                       /*!< 400MHz Phase-Locked Loop Clock */
    CYHAL_CLOCK_BLOCK_ECO_PRESCALER,                                /*!< ECO Prescaler Divider */

    CYHAL_CLOCK_BLOCK_LF,                                           /*!< Low Frequency Clock */
    CYHAL_CLOCK_BLOCK_HF,                                           /*!< High Frequency Clock */
    CYHAL_CLOCK_BLOCK_PUMP,                                         /*!< Analog Pump Clock */
    CYHAL_CLOCK_BLOCK_BAK,                                          /*!< Backup Power Domain Clock */
    CYHAL_CLOCK_BLOCK_ALT_SYS_TICK,                                 /*!< Alternative SysTick Clock */

    CYHAL_CLOCK_BLOCK_PERI,                                         /*!< Peripheral Clock Group */
    CYHAL_CLOCK_BLOCK_FAST,                                         /*!< Fast Clock for CM7 */
    CYHAL_CLOCK_BLOCK_SLOW,                                         /*!< Slow Clock for CM0+ */
    CYHAL_CLOCK_BLOCK_TIMER,                                        /*!< CLK TIMER */
    CYHAL_CLOCK_BLOCK_MEM,                                          /*!< CLK MEM */
#endif
} cyhal_clock_block_t;

/** @brief Clock object
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases. */
typedef struct
{
    cyhal_clock_block_t     block;
    uint8_t                 channel;
    bool                    reserved;
    const void*             funcs;
} cyhal_clock_t;

/**
  * @brief Represents a particular instance of a resource on the chip.
  * Application code should not rely on the specific contents of this struct.
  * They are considered an implementation detail which is subject to change
  * between platforms and/or HAL releases.
  */
typedef struct
{
    cyhal_resource_t type;      //!< The resource block type
    uint8_t          block_num; //!< The resource block index
    /**
      * The channel number, if the resource type defines multiple channels
      * per block instance. Otherwise, 0 */
    uint8_t          channel_num;
} cyhal_resource_inst_t;

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/** \} group_hal_impl_hw_types */
